---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.DuctFailures
source: html/291655b1-84c9-1462-0a29-d85c20c5623b.htm
---
# BuiltInFailures.DuctFailures Properties

Cannot create geometry for flex duct. The flex duct is intersecting itself or the start and end are too close together.